In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df['Name'].sample(20)

853                            Lines, Miss. Mary Conover
633                        Parr, Mr. William Henry Marsh
315                      Nilsson, Miss. Helmina Josefina
502                       O'Sullivan, Miss. Bridget Mary
137                          Futrelle, Mr. Jacques Heath
352                                   Elias, Mr. Tannous
754                     Herman, Mrs. Samuel (Jane Laver)
526                                 Ridsdale, Miss. Lucy
180                         Sage, Miss. Constance Gladys
401                                      Adams, Mr. John
427    Phillips, Miss. Kate Florence ("Mrs Kate Louis...
393                               Newell, Miss. Marjorie
227                      Lovell, Mr. John Hall ("Henry")
304                    Williams, Mr. Howard Hugh "Harry"
191                                Carbines, Mr. William
377                            Widener, Mr. Harry Elkins
66                          Nye, Mrs. (Elizabeth Ramell)
654                         Hegarty, Miss. Hanora "Nora"
313                               Hendekovic, Mr. Ignjac
110                       Porter, Mr. Walter Chamberlain
Name: Name, dtype: object

In [7]:
df[['Name', 'Sex', 'Age']].sample(10)

                                  Name     Sex   Age
561                  Sivic, Mr. Husein    male  40.0
714              Greenberg, Mr. Samuel    male  52.0
454                Peduzzi, Mr. Joseph    male   NaN
285                Stankovic, Mr. Ivan    male  33.0
782             Long, Mr. Milton Clyde    male  29.0
125       Nicola-Yarred, Master. Elias    male  12.0
276  Lindblom, Miss. Augusta Charlotta  female  45.0
772                  Mack, Mrs. (Mary)  female  57.0
76                   Staneff, Mr. Ivan    male   NaN
74                       Bing, Mr. Lee    male  32.0

In [35]:
df.iloc[:1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,S

In [37]:
# for index, row in df.iterrows():
#     print(index, row("Name"))

In [10]:
df.loc[df['Name']=='Allen, Mr. William Henry']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [11]:
df.loc[df['Ticket']=="STON/O2. 3101282"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [12]:
# description of the dataset
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
# information of the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
#Average age of
df['Age'].mean()

29.69911764705882

In [15]:
#max age of
df['Age'].max()

80.0

In [16]:
#search for max age
df.loc[df['Age']==80]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [17]:
df['Age'].min()

0.42

In [18]:
df.agg({"Age":["min","median", "skew", "max", "count"],"Fare":["min","median", "skew", "max", "count"]})

               Age        Fare
min       0.420000    0.000000
median   28.000000   14.454200
skew      0.389108    4.787317
max      80.000000  512.329200
count   714.000000  891.000000

### POKEMON DATASET


#### E T L
E  - extract
T  -  Transform
L - Load

In [19]:
#explore data | Load csv data 
pk = pd.read_csv('pokemon.csv')
pk

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

In [43]:
#explore data | Load txt data 
pkt = pd.read_csv('pokemon.txt', delimiter="\t")
pkt.head(5)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [45]:
exc = pkt.to_excel('modifiedpokemon.xlsx')
exc

In [21]:
pk.head(5)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

### DATA CLEANING

#checking null values

In [22]:
pk_null = pk.isnull().sum()
pk_null

#               0
Name            0
Type 1          0
Type 2        386
HP              0
Attack          0
Defense         0
Sp. Atk         0
Sp. Def         0
Speed           0
Generation      0
Legendary       0
dtype: int64

In [23]:
#titanic
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [24]:
#mean, std, median

In [25]:
#mean of titanic df
df_Age = df['Age'].mean()
df_Age_m = round(df_Age, 0)
df_Age_m

30.0

In [26]:
#std of titanic df
df_Age = df['Age'].std()
df_Age = round(df_Age, 0)
df_Age

15.0

In [27]:
#median of titanic df
df_Age = df['Age'].median()
df_Age = round(df_Age, 0)
df_Age

28.0

In [28]:
#replacing null Age with actual avearage age (mean)

df['Age'].fillna(df_Age_m, inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
df.drop(columns=['Cabin'], inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [30]:
#unique values for embarked
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [31]:
#replace missing embarked with q
df['Embarked'].fillna('Q', inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64